/*1. Создать классы Собака и Кот с наследованием от класса Животное.
  2. Все животные могут бежать и плыть. В качестве параметра каждому методу передается длина препятствия. Результатом выполнения действия будет печать в консоль. (Например, dogBobik.run(150); -> 'Бобик пробежал 150 м.');
  3. У каждого животного есть ограничения на действия (бег: кот 200 м., собака 500 м.; плавание: кот не умеет плавать, собака 10 м.).
  4. * Добавить подсчет созданных котов, собак и животных.*/
public class homeWork6  {
    public static void main(String[] args) {
        Dog dog = new Dog("Тузик","черно-белого цвета",4);
        Cat cat = new Cat("Мурка","черно-рыжего цвета",2);
        Cat cat2 = new Cat("Мурка","черно-рыжего цвета",4);

        dog.run(15);
        cat.run(500);

        dog.swim(11);
        cat.swim(11);
        System.out.println(cat2.amountOfCats);
        System.out.println(dog.amountOfDogs);
    }

}

