/*
1. Расширить задачу про котов и тарелки с едой.
2. Сделать так, чтобы в тарелке с едой не могло получиться отрицательного количества еды (например, в миске 10 еды, а кот пытается покушать 15-20).
3. Каждому коту нужно добавить поле сытость (когда создаем котов, они голодны). Если коту удалось покушать (хватило еды), сытость = true.
4. Считаем, что если коту мало еды в тарелке, то он её просто не трогает, то есть не может быть наполовину сыт (это сделано для упрощения логики программы).
5. Создать массив котов и тарелку с едой, попросить всех котов покушать из этой тарелки и потом вывести информацию о сытости котов в консоль.
6. Добавить в тарелку метод, с помощью которого можно было бы добавлять еду в тарелку.
 */

public class Homework7 {
    public static void main(String[] args) {

        Plate plate = new Plate(25);

        Cat[] cats = new Cat[6];// массив котов
        cats[0] = new Cat("Томас",9);
        cats[1] = new Cat("Бегемот",7);
        cats[2] = new Cat("Филипп Маркович",8);
        cats[3] = new Cat("Пушок",9);
        cats[4] = new Cat("Василёк",5);
        cats[5] = new Cat("Глазик",6);

        for (int i = 0; i < cats.length; i++) {
            cats[i].eat(plate);
            System.out.println(cats[i]);//выводиться информация о коте и поёл он или нет
            /*
            Результат работы программы:
            Состояние сытости кота по кличке Томас, равняется true
            Состояние сытости кота по кличке Бегемот, равняется true
            Состояние сытости кота по кличке Филипп Маркович, равняется true
            Состояние сытости кота по кличке Пушок, равняется false
            Состояние сытости кота по кличке Василёк, равняется false
            Состояние сытости кота по кличке Глазик, равняется false
             */

        }
    }
}
